//This query looks at unsuccessful sign ins from an IP address to an account, where the password used was correct but the session could have been interrupted by other means. This could potentially indicate a compromise credential
let Threshold = 15;
SigninLogs
| where parse_json(AuthenticationDetails)[0].authenticationMethod == "Password"
| where ResultType != "0"
| extend PasswordResult = tostring(parse_json(AuthenticationDetails)[0].authenticationStepResultDetail)
| where PasswordResult == "Correct password"
| extend RiskDetails = bag_pack("Risk Detail",RiskDetail,"Risk Event",RiskEventTypes_V2, "Aggregated Risk", RiskLevelAggregated, "Sign In Risk", RiskLevelDuringSignIn, "Risk State",RiskState)
| summarize FailCount = countif(PasswordResult != "Correct password"), AffectedAccounts = make_set(UserPrincipalName), ResourcesAccessesAttemp = make_set(ResourceDisplayName),  RiskSummary = make_set(RiskDetail), ResultDescription = make_set(ResultDescription) by IPAddress
| where FailCount >= Threshold
