id: 5a0a749a-ca93-496a-9563-a916b13f7ceb
name: New Cliet App Observed - WIP
description: |
  'Identifies new client app used by a user by comparing their activity from the last seven days.'
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - SigninLogs
tactics:
  - InitialAccess
  - Persistence
relevantTechniques:
  - T1078.004
  - T0859
query: |
  // Creating a set of known client app used by a user
  let CommonClientUsed = (
  SigninLogs
  // Increase Time as needed
  | where TimeGenerated >ago(7d)
  | where ResultType == 0
  | summarize BaselineClientApp =make_set(ClientAppUsed) by UserPrincipalName );
  // create a set to see the recent client app used by a user 
  let NewClient = (
  SigninLogs
  | where TimeGenerated >= ago(1h)
  | where ResultType == 0
  | summarize NewClient = make_set(ClientAppUsed) by UserPrincipalName
  );
  // Join both tables by user to prepare for comparison
  CommonClientUsed
  | join kind=inner NewClient on UserPrincipalName
  // Compares both arrays and identifies which NewClient was not on the Baseline set.
  | extend ClieAppDiff = set_difference(NewClient,BaselineClientApp)
  // | where ClieAppDiff != "[]" // Just another way to remove empty events.
  | where array_length( ClieAppDiff) > 0
  // Getting UserName and Domain
  | extend Name = split(UserPrincipalName,"@",0),
      Domain = split(UserPrincipalName,"@",1)
  | mv-expand Name,Domain
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: Name
      - identifier: NTDomain
        columnName: Domain 
customDetails:
  ClieAppDiff: ClieAppDiff
version: 1.0.0